from Random_number import list
# a = [9, 12, 12, 9, 22, 1, 1, 22, 56, 1, 9, 45, 12, 9]
# print(a.count(56))
new_list =[el for el in list if list.count(el) == 1]
print(list)
# b = []
# for el in a:
#     if a.count(el) > 1:
#         a.remove(el)
#     b = a
# print(b)
# \\вот тут выполнил задание таким способом так как неправильно понял поставленную задачу - выводил список
# \ удалив все повторяющиеся значения. Но к сожалению столкнулся с темб что не смог записать это решение в одну строку
# \ Буду благодарен, если подскажете как вписать это решение в одну строку, если это возможно сделать.

